"""
금융사 이름에 대한 정보
적요: 금융사 이름
"""

name_map = {
    '신한': '신한은행',
    '우리': '우리은행',
    'KB페이': 'KB페이',
    'KB손보': 'KB손해보험',
    '국민': '국민은행',
    '하나': '하나은행',
    '토뱅': '토스뱅크',
    '카뱅': '카카오뱅크',
    '카카': '카카오뱅크',
    '카카오뱅크': '카카오뱅크',
    '케이뱅크': '케이뱅크',
    'K뱅': '케이뱅크',
    '대구': '대구은행',
    '경남': '경남은행',
    '전북': '전북은행',
    '광주': '광주은행',
    '새마을': '새마을금고',
    '(새마을': '새마을금고',
    '기업': 'IBK기업은행',
    '도이치': '도이치은행',
    '부산': '부산은행',
    'BNK': '부산은행',
    '산업': 'KDB산업은행',
    'KDB': 'KDB산업은행',
    '수협': '수협은행',
    '우체국': '우체국은행',
    '지역농': '지역농축협',
    '지역농축': '지역농축협',
    '씨티': '한국씨티은행',
    '한국씨티': '한국씨티은행',
    'BOA은행': 'BOA',
    '농협': 'NH농협은행',
    'NH': 'NH농협은행',
    'SC': 'SC제일은행',
    'SC제일': 'SC제일은행',
    'DB': 'DB저축은행',
    '제이티친애': 'JT친애저축은행',
    '오케이저축': 'OK저축은행',
    'OSB저축': 'OSB저축은행',
    'SBI': 'SBI저축은행',
    '대신저축': '대신저축은행',
    '더케이저축': '더케이저축은행',
    '((주)HB저': 'HB저축은행',
    '바로': '바로저축은행',
    '신한저축': '신한저축은행',
    '애큐온': '애큐온저축은행',
    '예가람': '예가람저축은행',
    '웰컴저축': '웰컴저축은행',
    '유안타': '유안타저축은행',
    '다올': '다올저축은행',
    '조은': '조은저축은행',
    '키움예': '키움예스저축은행',
    'JT저축은행': 'JT저축은행',
    '금화저축은행': '금화저축은행',
    '모아저': '모아저축은행',
    '부림저': '부림저축은행',
    '삼정저축은행': '삼정저축은행',
    '상상인저축': '상상인저축은행',
    '세람저': '세람저축은행',
    '안국저축은행': '안국저축은행',
    '안양저축은행': '안양저축은행',
    '영진저축은행': '영진저축은행',
    '융창': '융창저축은행',
    '인성저': '인성저축은행',
    '인천저축은행': '인천저축은행',
    '키움저': '키움저축은행',
    '페퍼저': '페퍼저축은행',
    '한국투자저축': '한국투자저축은행',
    '한화저축': '한화저축은행',
    'IBK저축': 'IBK저축은행',
    '고려저': '고려저축은행',
    '동원제': '동원제일저축은행',
    '우리저축은행': '우리저축은행',
    '조흥저축은행': '조흥저축은행',
    '진주저축': '진주저축은행',
    '엠에스상': '엠에스상호저축은행',
    '참저축은행': '참저축은행',
    '대한저': '대한저축은행',
    '동양저축은행': '동양저축은행',
    '삼호저': '삼호저축은행',
    '스마트저축': '스마트저축은행',
    '(주)스마트': '스마트저축은행',
    '대명저축은행': '대명저축은행',
    '상상인플': '상상인플러스저축은행',
    '우리금융저축': '우리금융저축은행',
    '(주)우리금': '우리금융저축은행',
    '오투저축은행': '오투저축은행',
    '청주저': '청주저축은행',
    '한성저축은': '한성저축은행'
}
name_map = name_map.items()
# 내림차순으로 정렬해서 긴게 먼저 판단되게
name_map = sorted(name_map, key=lambda x: x[0], reverse=True)


def find_finance_vendor(name):
    """
    결제 적요로 금융사 이름을 찾습니다.
    :param name:
    :return:
    """
    for pn, fv in name_map:
        if pn in name:
            return fv
    return None